content/docs/build/TerminalConfiguration/Linux-technology-6-2-sysstat.org
#+TITLE: System Management
#+DATE: <2024-06-09 Sun>
#+AUTHOR: EndlessPeak
#+TOC: true
#+HIDDEN: false
#+DRAFT: false
#+WEIGHT: 3
#+Description: 

* Mem management 
** All Mem statistic
统计本机所有内存使用量。
#+begin_src shell
  free -h
#+end_src

** Sort by all user
统计所有用户的内存使用量。 
#+begin_src shell
  ps aux --sort=-%mem | head -n 10 | awk 'NR==1 {print $0; next} { $5=int($5/1024) "M"; $6=int($6/1024) "M"; $11=substr($11, 1, 100); print $0; }'
#+end_src

其中，~$11=substr($11, 1, 100);~ 是因为某些命令过长需要进行限制，如 =pycharm= 或 =distrobox= 等。

** Sort by someone
统计指定用户的内存使用量。
方法一：首先提取表头，然后显示内容及排序。
#+begin_src shell
  ps aux --sort=-%mem | head -n 1 && ps aux --sort=-%mem | grep '^chan' | head -n 10 | awk '{ $5=int($5/1024) "M"; $6=int($6/1024) "M"; print $0; }'
#+end_src

方法二：手动输出表头，然后显示内容及排序。
#+begin_src shell
  echo "USER         PID %CPU %MEM    VSZ   RSS TTY      STAT START   TIME COMMAND"
  ps aux --sort=-%mem | grep '^chan' | head -n 10 | awk '{ $5=int($5/1024) "M"; $6=int($6/1024) "M"; print $0; }'
#+end_src

** Monitor
实时监控内存，可以将上述命令编为脚本，然后使用watch循环输出。
#+begin_src shell
  watch -n 1 ./top_10_mem.sh
#+end_src

** Swapfile
内存不够时可以通过添加 =swapfile= 或者开启 =swap partion= 解决。

生成交换文件。
#+begin_src shell
  fallocate -l 32G /swapfile
  dd if=/dev/zero of=/swapfile bs=1M count=32768
#+end_src

设置权限并格式化文件。
#+begin_src shell
  chmod 600 /swapfile
  mkswap /swapfile
#+end_src

开启交换文件。
#+begin_src shell
  swapon /swapfile
  swapon --show
#+end_src

关闭交换文件
#+begin_src shell
  swapoff /swapfile
#+end_src

如果需要用大交换文件替换小交换文件，建议先开后关。
